#include "domain.h"

/*
 * В этом файле вы можете разместить классы/структуры, которые являются частью предметной области
 * (domain) вашего приложения и не зависят от транспортного справочника. Например Автобусные
 * маршруты и Остановки.
 *
 * Их можно было бы разместить и в transport_catalogue.h, однако вынесение их в отдельный
 * заголовочный файл может оказаться полезным, когда дело дойдёт до визуализации карты маршрутов:
 * визуализатор карты (map_renderer) можно будет сделать независящим от транспортного справочника.
 *
 * Если структура вашего приложения не позволяет так сделать, просто оставьте этот файл пустым.
 *
 */

// domain.cpp
// domain.h
// geo.cpp
// geo.h
// json.cpp
// json.h
// json_reader.cpp
// json_reader.h
// main.cpp
// map_renderer.cpp
// map_renderer.h
// request_handler.cpp
// request_handler.h
// svg.cpp
// svg.h
// transport_catalogue.cpp
// transport_catalogue.h
